In [1]:
import pandas as pd

In [2]:
pd.__version__

'0.25.1'

In [14]:
s = pd.Series([2,3,4,5,6,7,8,9], dtype="int64")

In [4]:
s[0]

2

In [7]:
s

0    2
1    3
2    4
3    5
4    6
5    7
6    8
7    9
dtype: int64

In [8]:
s[0:5]

0    2
1    3
2    4
3    5
4    6
dtype: int64

In [9]:
s.index

RangeIndex(start=0, stop=8, step=1)

In [15]:
s.dtype

dtype('int64')

NameError: name 'int32' is not defined

In [16]:
s.keys

<bound method Series.keys of 0    2
1    3
2    4
3    5
4    6
5    7
6    8
7    9
dtype: int64>

In [17]:
s.values

array([2, 3, 4, 5, 6, 7, 8, 9], dtype=int64)

In [18]:
s.index = [12,13,14,15,16,17,18,19]

In [19]:
s

12    2
13    3
14    4
15    5
16    6
17    7
18    8
19    9
dtype: int64

In [23]:
s = pd.Series(["a","b",1])

In [25]:
type(s)

pandas.core.series.Series

In [26]:
s

0    a
1    b
2    1
dtype: object

In [63]:
a = pd.Series([97,98,99,100])

In [64]:
a

0     97
1     98
2     99
3    100
dtype: int64

In [65]:
a.index

RangeIndex(start=0, stop=4, step=1)

In [66]:
a.index = ['a','b','c',1]

In [67]:
a

a     97
b     98
c     99
1    100
dtype: int64

In [38]:
b = pd.Series([97,98,99,100,101])

In [43]:
d = { 'dikhit':22, 'kashmiri' : 22, 'jyotishman':22, 'bikash' : 21 }

In [44]:
d

{'dikhit': 22, 'kashmiri': 22, 'jyotishman': 22, 'bikash': 21}

In [45]:
s = pd.Series(d)

In [46]:
s

dikhit        22
kashmiri      22
jyotishman    22
bikash        21
dtype: int64

In [56]:
s2 = pd.Series(10, index = [num for num in range(1,6)])

In [52]:
pd.Series(10, index = [1,2,3,4,5])

1    10
2    10
3    10
4    10
5    10
dtype: int64

In [68]:
a

a     97
b     98
c     99
1    100
dtype: int64

In [69]:
s2

1    10
2    10
3    10
4    10
5    10
dtype: int64

In [71]:
join = pd.concat([a,s2])

In [72]:
join[1]

1    100
1     10
dtype: int64

In [73]:
join_nice = pd.concat([a,s2], axis=1)

In [77]:
join_nice

       0     1
1  100.0  10.0
2    NaN  10.0
3    NaN  10.0
4    NaN  10.0
5    NaN  10.0
a   97.0   NaN
b   98.0   NaN
c   99.0   NaN

In [76]:
join_nice = pd.concat([a,s2], axis=1)

In [82]:
from selenium import webdriver
from selenium.webdriver.common.keys import Keys
executable_path = "C:\\Users\\Katlic\\Downloads\\web_drivers_chrome\\chromedriver.exe"


driver = webdriver.Chrome(executable_path=executable_path)
driver.get("https://www.veenaworld.com/india/jaipur-tour-packages/ct")
tours = []
for i in range(2,10):
    xpath = '//*[@id="searchList"]/div/div[1]/div/div[1]/div[' + str(i) + ']/vw-tile-item-v3/div/div/div[2]/div[2]/div[1]/div[1]/div[1]/a/h3'
    try:
        tour = driver.find_element_by_xpath(xpath)
        tours.append(tour)
    except:
        print("not found")
        
prices = []
for i in range(2,10):
    xpath = '//*[@id="searchList"]/div/div[1]/div/div[1]/div[' + str(i) + ']/vw-tile-item-v3/div/div/div[2]/div[2]/div[2]/div[2]/div[3]/a'
    try:
        price = driver.find_element_by_xpath(xpath)
        prices.append(price)
    except:
        print("not found")
 

n = []
p = []

for i in range(8):
    n.append(tours[i].text)
    p.append(prices[i].text)

    
df = pd.DataFrame({'tours' : n, 'Price' : p})

In [84]:
df.to_csv("Data.xlsx")

In [85]:
df.head()

                          tours    Price
0  Rajasthan Highlights - I Fly  ₹30,000
1               Rajasthan Mewad  ₹30,000
2              Rajasthan Marwad  ₹30,000
3        Rajasthan Mewad - Ifly  ₹38,000
4       Rajasthan Marwad - Ifly  ₹40,000

In [87]:
df.tail(n=4)

                           tours    Price
4        Rajasthan Marwad - Ifly  ₹40,000
5    Rajasthan Mewad - Ifly Pune  ₹42,000
6         Rajasthan Mewad Marwad  ₹64,000
7  Rajasthan Mewad Marwad - Ifly  ₹73,000

In [88]:
df.tail()

                           tours    Price
3         Rajasthan Mewad - Ifly  ₹38,000
4        Rajasthan Marwad - Ifly  ₹40,000
5    Rajasthan Mewad - Ifly Pune  ₹42,000
6         Rajasthan Mewad Marwad  ₹64,000
7  Rajasthan Mewad Marwad - Ifly  ₹73,000

In [89]:
df

                           tours    Price
0   Rajasthan Highlights - I Fly  ₹30,000
1                Rajasthan Mewad  ₹30,000
2               Rajasthan Marwad  ₹30,000
3         Rajasthan Mewad - Ifly  ₹38,000
4        Rajasthan Marwad - Ifly  ₹40,000
5    Rajasthan Mewad - Ifly Pune  ₹42,000
6         Rajasthan Mewad Marwad  ₹64,000
7  Rajasthan Mewad Marwad - Ifly  ₹73,000

In [92]:
s = pd.Series([True, False, True, False])

In [94]:
d

{'dikhit': 22, 'kashmiri': 22, 'jyotishman': 22, 'bikash': 21}

In [105]:
age = pd.Series([22,22,21])

In [106]:
name = pd.Series(['Dikhit', "Jyotishman", "Bikash"])

In [107]:
df2 = pd.DataFrame({'age' : age, 'name': name})

In [108]:
df2

   age        name
0   22      Dikhit
1   22  Jyotishman
2   21      Bikash

In [109]:
df2[df2['age'] > 21]

   age        name
0   22      Dikhit
1   22  Jyotishman